[
    {
        "id": "portfolio_website",
        "title": "Portfolio Website",
        "description": "Custom Portfolio Website",
        "tech": ["HTML", "CSS", "JavaScript"],
        "repl": "https://hunter-1217-githubio--Hunter787.replit.app?lite=true",
        "repo": "https://github.com/Hunter1217/hunter1217.github.io"
    },
    {
        "id": "connect_ai",
        "title": "Connect Four game with built in AI Opponent",
        "description": "Built a fully playable Connect Four game in Python using NumPy, featuring a modular and maintainable architecture with clear separation between game logic, user interaction, and AI decision-making. Implemented an AI opponent using a depth-limited Minimax algorithm with Alpha-Beta Pruning, optimized through heuristic move ordering to improve search efficiency. Designed a custom evaluation function to score board states by detecting winning patterns, penalizing opponent threats, and prioritizing strategic center control. Enforced full game rules including move validation, gravity-based piece placement, terminal state detection, and multi-directional win checking, while incorporating logging to analyze pruning behavior and support debugging and performance tuning.",
        "tech": ["Python", "Numpy", "Minimax with Alpha-Beta Pruning", "Heuristic Evaluation"],
        "repl": "https://replit.com/@Hunter787/Connect-Four-AI-Minimax-Alpha-Beta-Pruning?embed=true",
        "repo": "https://github.com/Hunter1217/Connect-Four-AI-Minimax-Alpha-Beta-Pruning"
    },
    {
        "id": "custom_shell",
        "title": "Custom Unix Shell",
        "description": "Built a custom Unix style shell in C that allows users to run system commands and includes several built in commands like cd, pwd, echo, and exit. The shell reads and parses user input, searches the system PATH to find executable programs, and runs them using child processes. To make the project more engaging, I added a terminal-based animation using ncurses that runs when the shell starts and can be triggered again with a custom command. This project helped me better understand how command-line shells work behind the scenes, including process creation, input handling, and interacting directly with the operating system.",
        "tech": ["C", "Systems Programming", "POSIX Process Control", "PATH resolution", "NCurses", "Dynamic Memory Management"],
        "repl": "https://replit.com/@Hunter787/Custom-Unix-Shell?lite=true",
        "repo": "https://github.com/Hunter1217/Custom-Unix-Shell"
    },
    {
        "id": "discord_bot",
        "title": "Music playing Discord Bot",
        "description": "Built a custom discord bot, for personal use, that has a variety of commands and features. Currently has to be running on a device in order to work properly because It isn't setup on a server of any sorts. Has music parsing capabilities, where when you enter a specific command followed by the song title, it gets that song from youtube, joins the voice channel in discord you're residing in, and starts playing the desired song. Other features include, sending direct messages, picking a random game from a selected list, ",
        "tech": ["Python", "Discord API", "Youtube API"],
        "repl": "https://replit.com/@Hunter787/Custom-Unix-Shell?lite=true",
        "repo": "https://github.com/Hunter1217/Custom-Unix-Shell"
    }
]
